
<?php

$_['title'] = 'Быстрый подбор запчастей';
$_['text'] = 'Быстрый подбор запчастей';
$_['my_var'] = 'Быстрый подбор запчастей';

// Text
$_['text_location']  = 'Заполните форму для отправки запроса';
$_['text_store']     = 'Наши магазины';
$_['text_vin']   = 'Запрос запчасти по VIN-номеру';
$_['text_address']   = 'Адрес';
$_['text_telephone'] = 'Телефон';
$_['text_fax']       = 'Факс';
$_['text_open']      = 'Режим работы';
$_['text_comment']   = 'Дополнительная информация';
$_['text_success']   = '<p>Ваше сообщение успешно отправлено владельцу магазина!</p>';
$_['text_phone']     = 'Телефон';
// Entry
$_['entry_name']     = 'Ваше имя';
$_['entry_email']    = 'Ваш E-Mail';
$_['entry_enquiry']  = 'Введите Ваш вопрос';
$_['entry_captcha']  = 'Введите код, указанный на картинке';
$_['entry_vin']		= 'Введите VIN-номер автомобиля';
$_['entry_phone'] 	= 'Введите телефон';
// Email
$_['email_subject']  = 'Сообщение от %s';

// Errors
$_['error_name']     = 'Имя должно быть от 3 до 32 символов!';
$_['error_email']    = 'E-mail адрес введен неверно!';
$_['error_enquiry']  = 'Введите, пожалуйста, ваш вопрос';
$_['error_captcha']  = 'Проверочный код не совпадает с изображением!';
$_['error_vin']		= 'Проверьте VIN-номер автомобиля';
$_['error_phone'] = 'Проверьте Ваш телефон';
?>
