<?php
//Heading
$_['heading_title'] = 'Universal Import/Export Pro';

//Текст
$_['text_module'] = 'Модули';
$_['text_browse'] = 'Обзор';
$_['text_continue'] = 'Следующий шаг';
$_['text_add_sub'] = 'Добавить';
$_['text_add_cat'] = 'Добавить категорию';
$_['text_add_subcat'] = 'Добавить подкатегорию';
$_['text_add_column'] = 'Добавить столбец';
$_['text_remove_column'] = 'Удалить столбец';
$_['not_found'] = 'Не найдено';
$_['new'] = 'new';

$_['text_success'] = 'Успех: вы изменили настройки!';
$_['text_store_select'] = 'Магазин:';
$_['text_import'] = 'Импорт';
$_['text_source_upload'] = 'Загрузить файл';
$_['text_source_ftp'] = 'FTP';
$_['text_source_url'] = 'URL';
$_['text_source_path'] = 'Локальный путь';
$_['text_type_product'] = 'Товар';
$_['text_type_product_update'] = 'Быстрое обновление товара';
$_['text_type_order'] = 'Заказ';
$_['text_type_order_status_update'] = 'Обновление статуса заказа';
$_['text_type_category'] = 'Категория';
$_['text_type_information'] = 'Информация';
$_['text_type_manufacturer'] = 'Производитель';
$_['text_type_customer'] = 'Клиент';
$_['text_subtype_order_info'] = 'Информация о заказе';
$_['text_subtype_order_item'] = 'Позиция заказа';
$_['text_type_attribute'] = 'Атрибут';
$_['text_type_filter'] = 'Фильтр';
$_['text_product'] = 'Продукты';
$_['text_category'] = 'Категории';
$_['text_information'] = 'Информация';
$_['text_manufacturer'] = 'Производители';
$_['text_customer'] = 'Клиенты';
$_['text_order'] = 'Заказы';
$_['text_order_status'] = 'Статусы заказа';
$_['text_ignore'] = '';
$_['text_column'] = 'столбец';
$_['text_next_step'] = 'Проверить и продолжить';
$_['text_start_process'] = 'Начать обработку импорта';
$_['text_pausing_process'] = 'Пауза, пожалуйста, подождите, пока последний пакет не прекратит работу ...';
$_['text_resume_process'] = 'Возобновить процесс';
$_['text_start_simu_process'] = 'Начать полное моделирование';
$_['text_pause_process'] = 'Выполняется импорт - нажмите, чтобы приостановить';
$_['text_pause_simu_process'] = 'Идет симуляция - нажмите, чтобы приостановить';
$_['text_previous_step'] = 'Предыдущий шаг';
$_['text_data_preview'] = 'Предварительный просмотр данных';
$_['text_row'] = 'Row';
$_['text_status'] = 'Статус';
$_['text_message'] = 'Сообщение';

$_['text_action_update'] = 'Обновить - заменить';
$_['text_action_soft_update'] = 'Обновить - сохранить';
$_['text_action_insert'] = 'Вставить';
$_['text_action_skip'] = 'Пропустить';
$_['text_action_option'] = 'Добавить опцию';
$_['text_action_delete'] = 'Удалить';
$_['text_action_overwrite'] = 'Перезаписать';
$_['text_action_rename'] = 'Переименовать';
$_['text_img_action_keep'] = 'Сохранить фактическое изображение';
$_['text_img_action_rename'] = 'Переименовать новое изображение';
$_['text_img_action_overwrite'] = 'Перезаписать новым изображением';

//Вкладки
$_['text_tab_0'] = 'Импорт';

$_['text_import_step1'] = '<b> Шаг 1 </b> - Выбор файла';
$_['text_import_step2'] = '<b> Шаг 2 </b> - Импорт настроек';
$_['text_import_step3'] = '<b> Шаг 3 </b> - Отображение столбцов';
$_['text_import_step4'] = '<b> Шаг 4 </b> - Проверка данных';
$_['text_import_step5'] = '<b> Шаг 5 </b> - Начать процесс';

//Менеджер профилей
$_['text_profile_dir_not_writable'] = 'Папка профиля недоступна для записи, убедитесь, что у вас есть права на запись в папку (и подпапки):';
$_['text_profile_name'] = 'Имя профиля';
$_['text_new_profile'] = '- Сохранить как новый профиль -';
$_['text_save_profile'] = 'Сохранить профиль';
$_['text_delete_profile'] = 'Удалить профиль';
$_['text_really_delete'] = 'Вы уверены, что хотите удалить этот профиль?';
$_['text_save_profile_i'] = 'Сохранить текущие настройки, чтобы использовать их для дальнейшего импорта. <br/> Вы можете выбрать существующий профиль, чтобы перезаписать его или создать новый.';
$_['text_profile_saved'] = 'Ваш профиль был правильно сохранен';
//Шаг 1
$_['entry_name'] = 'Name';
$_['entry_demo_file'] = 'Загрузить демонстрационный файл';
$_['entry_demo_file_i'] = 'Используйте предварительно загруженные файлы, чтобы проверить поведение модуля. Если вы хотите загрузить свой собственный файл, оставьте это поле пустым и загрузите файл в предыдущем поле. ';
$_['entry_type'] = 'Тип импорта';
$_['entry_subtype'] = 'Импортировать подтип';
$_['entry_type_i'] = 'Какие данные вы собираетесь импортировать?';
$_['entry_profile'] = 'Профиль настроек';
$_['text_select_profile'] = 'Выбрать профиль настройки';
$_['entry_profile_i'] = 'Профиль содержит все настройки, которые вы можете установить в шагах 2 и 3. Вы можете сохранить новый профиль в шаге 4';
$_['entry_file'] = 'Выбрать источник файла';
$_['entry_file_i'] = 'Выберите здесь свой файл. <br/> Поддерживается неограниченный размер. <br/> Совместимые форматы: CSV, XML, XLS, XLSX, ODS';
$_['source_ftp'] = 'FTP-соединение';
$_['source_ftp_i'] = 'Подключитесь к FTP, чтобы получить файл, не забудьте начальный ftp: //';
$_['source_ftp_path'] = 'Путь к файлу FTP';
$_['source_url'] = 'Ссылка на файл';
$_['source_url_i'] = 'Получить файл из внешнего URL-адреса, если файл защищен паролем, установите URL-адрес следующим образом: http: //user: password@website.tld /...';
$_['source_path'] = 'Путь к локальному файлу';
$_['source_path_i'] = 'Это относится к файлу на вашем сервере';
$_['text_extension_auto'] = 'Расширение автоопределения';
$_['text_dropzone'] = 'Перетащите файл сюда или нажмите, чтобы загрузить';
$_['text_file_loaded'] = 'Файл загружен:';
$_['text_file_error'] = 'Ошибка:';

//Шаг 2
$_['text_common_settings'] = 'Общие настройки';
$_['entry_xml_node'] = 'Узел элемента XML';
$_['entry_xml_node_i'] = 'Установить узел xml для каждого элемента в вашем файле, например, <product> или <item> (установить значение без скобок). Система попытается автоматически определить его, просто измените его, если неверное значение ';
$_['entry_csv_separator'] = 'Разделитель полей CSV';
$_['entry_multiple_separator'] = 'Разделитель нескольких значений';
$_['entry_multiple_separator_i'] = 'Если поле содержит несколько значений, определите символ, используемый для их разделения';
$_['entry_xls_sheet'] = 'Рабочий лист';
$_['entry_xls_sheet_i'] = 'Если ваш файл содержит различные листы, вы можете выбрать тот, с которым будете работать';
$_['entry_csv_header'] = 'Первая строка - заголовок';
$_['entry_item_identifier'] = 'Идентификатор существующего элемента';
$_['entry_item_identifier_i'] = 'Определить, существует ли элемент, который вы собираетесь вставить, если он соответствует этому полю';
$_['entry_item_exists'] = 'Существующее действие элемента';
$_['entry_item_exists_i'] = 'Режим замены: все значения будут обновлены, отображение пустых столбцов означает, что будет удалено любое фактическое значение (это использует метод ocStore по умолчанию и включает любые изменения, примененные к нему) - Режим сохранения: будет обновить только поля, заданные в сопоставлении столбцов, пустое поле означает отсутствие изменения фактического значения (не метод ocStore, пользовательские значения здесь не могут применяться) ';
$_['entry_item_not_exists'] = 'Действие нового элемента';
$_['text_image_settings'] = 'Настройки изображения';
$_['entry_image_download'] = 'Загрузить изображения';
$_['entry_image_download_i'] = 'Если изображение является внешним URL-адресом, автоматически загрузите его на свой сервер, чтобы связать существующие изображения, используйте путь относительно /image /catalog /';
$_['entry_image_exists'] = 'Изображение существует действие';
$_['text_delete_settings'] = 'Удалить или отключить элементы';
$_['entry_delete'] = 'Mode';
$_['entry_delete_action'] = 'Action';
$_['entry_delete_batch'] = 'Импортировать метку';
$_['entry_no_delete_skipped'] = 'Пропущено';
$_['text_no_delete_skipped_off'] = 'Удалить также пропущенные элементы';
$_['text_no_delete_skipped_on'] = 'Не удалять пропущенные элементы';
$_['text_delete_nothing'] = 'Не удалять ничего';
$_['text_delete_all'] = 'Для всех элементов перед импортом';
$_['text_delete_batch'] = 'Для всех элементов определенной метки импорта';
$_['text_delete_missing'] = 'Только для не обновленных элементов';
$_['text_delete_missing_brand'] = 'Для не обновленных товаров, но только для обновленных брендов';
$_['text_delete_zero'] = 'Установить количество на ноль';
$_['batch_delete_everything'] = 'Любая метка импорта';
$_['batch_delete_empty'] = 'Нет метки импорта';
$_['batch_delete_defined'] = 'Существующая метка импорта';
$_['batch_group_general'] = 'Удалить элементы с помощью:';
$_['batch_group_specific'] = 'Или только с определенной меткой импорта:';
$_['warning_delete'] = 'Предупреждение: элементы будут удалены из базы данных, убедитесь, что это именно то, что вам нужно';
$_['text_deleted'] = 'Удаленный элемент:';
$_['text_nothing_deleted'] = 'нечего удалять';
$_['text_disabled_all'] = 'Установить все элементы на отключенные';
$_['text_delete_delete'] = 'Удалить (удалить из базы данных)';
$_['text_delete_disable'] = 'Отключить (установить статус отключенным)';
$_['entry_image_exists_i'] = 'Что делать, если изображение с таким именем уже существует?';
$_['entry_image_location'] = 'Расположение изображения';
$_['entry_image_location_i'] = 'В случае загрузки изображений, поместите их в определенный каталог (например, products /). Этот параметр не используется в случае существующих изображений ';
$_['entry_image_keep_path'] = 'Реплицировать URL-путь';
$_['entry_image_keep_path_i'] = 'Сохранить ту же структуру, что и в текущем местоположении. Например, если url - myshop.com/dir/subdir/image.jpg, изображение будет сохранено в dir /subdir /image.jpg. ';
$_['text_category_settings'] = 'Настройки категории';
$_['entry_category_create'] = 'Создать, если не существует';
$_['entry_include_subcat'] = 'Включить товар в родителей';
$_['entry_include_subcat_i'] = 'Если у вас есть определенная категория, например «Рабочий стол»> «ПК»> «Клавиатуры», то по умолчанию продукт перейдет в «Клавиатуры», если вы установите родительский режим, он перейдет в «Клавиатуры и ПК», а если вы установите все это пойдет во все эти 3 категории ';
$_['entry_filter_to_category'] = 'Автоматическое создание фильтров';
$_['entry_filter_to_category_i'] = 'Автоматически добавлять фильтры импортируемых товаров в соответствующие категории';
$_['text_include_subcat_none'] = 'Поместить товар только в определенную категорию';
$_['text_include_subcat_parent'] = 'Поместить товар также в родительскую категорию';
$_['text_include_subcat_all'] = 'Поместить товар во все родительские категории';
$_['text_manufacturer_settings'] = 'Настройки производителя';
$_['entry_manufacturer_create'] = 'Создать, если не существует';
$_['text_product_settings'] = 'Настройки продукта';
$_['entry_preserve_attribute'] = 'Сохранить атрибуты';
$_['entry_preserve_attribute_i'] = 'Если разрешенные атрибуты не будут сброшены при импорте, это работает только в режиме сохранения обновления!';
$_['entry_filter_generate'] = 'Создать фильтры из';
$_['entry_filter_generate_i'] = 'Установите эти параметры, чтобы автоматически генерировать фильтры продуктов на основе следующих полей';
$_['entry_limit'] = 'Ограничить импорт';
$_['entry_limit_i'] = 'Ограничить количество элементов для импорта. Начало: начать с этой строки элемента - Конец: остановить на этой строке элемента';
$_['entry_limit_start'] = 'Начать строку';
$_['entry_limit_max'] = 'Макс. предметов';
$_['text_extra_fields'] = 'Дополнительные поля';
$_['entry_extra_fields'] = 'Дополнительные поля';
$_['entry_extra_fields_i'] = 'Разделенные запятыми, добавьте столько полей, сколько вам нужно для дальнейшего использования с дополнительными функциями, например, вы можете выполнить некоторую операцию над существующим полем вашего канала, а затем сохранить результат в дополнительном поле.';
$_['text_limit_settings'] = 'Ограничить набор данных';
$_['entry_limit_batch_status'] = 'Ограничить метку импорта';
$_['entry_limit_field_status'] = 'Ограничение на поле БД';
$_['entry_limit_field'] = 'Ограничить поле БД, если';
$_['import_all_attribute'] = 'Импортировать все атрибуты';
$_['import_product_attribute'] = 'Импорт атрибутов продукта';
$_['text_import_product_attributes'] = 'Импортируйте атрибуты непосредственно в ваши продукты, вам нужно выбрать идентификатор продукта, в который будет добавлен атрибут.';
$_['entry_delete_attributes'] = 'Очистить атрибуты';
$_['entry_delete_attributes_i'] = 'Включите эту опцию, если вы хотите очистить текущие атрибуты продукта перед импортом';
$_['entry_attribute_id'] = 'ID атрибута';
$_['entry_attribute_name'] = 'Имя атрибута';
$_['import_all_filter'] = 'Импортировать все фильтры';
$_['import_product_filter'] = 'Импортировать фильтры товаров';
$_['text_import_product_filters'] = 'Импортируйте фильтры непосредственно в ваши продукты, вам нужно выбрать идентификатор продукта, в который будет добавлен фильтр.';
$_['entry_delete_filter'] = 'Очистить атрибуты';
$_['entry_delete_filter_i'] = 'Включите эту опцию, если вы хотите очистить фильтры текущего продукта перед импортом';
$_['entry_filter_id'] = 'ID фильтра';
$_['entry_filter_name'] = 'Имя фильтра';
$_['entry_sort_order'] = 'Порядок сортировки';

//Шаг 3
$_['tab_order'] = 'Заказ';
$_['tab_info'] = 'Дополнительная информация';
$_['tab_extra'] = 'Пользовательские поля';
$_['entry_extra'] = 'Пользовательское поле';
$_['entry_extra_ml'] = 'Описание настраиваемого поля';
$_['entry_disable_config'] = 'Отключить конфигурацию';
$_['placeholder_disable_config'] = 'config_module_option, config_extra_option';
$_['placeholder_extra_col'] = 'Имя поля';
$_['tab_disable_cfg'] = 'Отключить параметры конфигурации';
$_['info_disable_cfg'] = 'Как и предыдущий параметр, это может быть полезно в случае, если какой-либо сторонний модуль хочет вставить данные при создании /редактировании элемента. <br/> Если в вашем импорте нет соответствующих данных файл и импорт завершается неудачно из-за отсутствия дополнительных данных, вы можете либо использовать опцию дополнительного поля с пустым значением, либо в некоторых случаях даже проще просто отключить соответствующую опцию конфигурации. <br/> <br/> Например, если у вас в модели есть что-то вроде этого: <br/> <code> if ($ this-> config-> get (\'superfilter_status\')) {<br/> & nbsp; & nbsp; & nbsp; //вставьте данные модуля ... <br/> & nbsp;} </code> <br/> <br/> Затем, если эта часть кода вызывает сбой при импорте, вы можете просто указать поле ниже «superfilter_status», оно временно установит это Параметр имеет значение false, чтобы вы могли избежать связанных ошибок при импорте. <br/> Используйте запятую в качестве разделителя, если вам нужно ввести различные значения. ';
$_['info_extra_field'] = 'Здесь вы можете определить свои собственные настраиваемые поля, это полезно в случае, если у вас есть модуль, который добавляет данные в ваши таблицы. <br/> Если настраиваемое поле многоязычное, оно сохраняется в части описания, так что вы должны использовать пользовательское поле Description, может быть полезно для модуля seo, например, который добавляет SEO H1 и другие данные, выясняет, какое имя используется этим модулем, и помещает «meta_h1» или «seo_h1» в поле имя, и в правом селекторе просто выберите, в какой столбец он будет принимать данные. <br/> <br/> Если во время импорта у вас есть неопределенные ошибки индекса, это происходит много раз, потому что у вас есть настраиваемые поля, добавленные модулями, поэтому При использовании этого раздела для добавления их в процесс импорта в сообщении об ошибке будет указано точное имя. <br/> <br/> Имя настраиваемого поля должно быть задано так, как оно отображается в вашей базе данных. ';
$_['text_remove_extra_col'] = 'Удалить настраиваемое поле';
$_['text_add_extra_field'] = 'Добавить новое настраиваемое поле';
$_['text_add_extra_field_ml'] = 'Добавить новое описание настраиваемое поле';
$_['tab_functions'] = 'Дополнительные функции';
$_['text_add_function'] = 'Добавить функцию';
$_['text_function_type'] = 'Тип';
$_['text_function_action'] = 'Действие';
$_['text_function_target'] = 'Сохранить результат в';
$_['text_function_same_field'] = 'Текущее поле';
$_['text_function_extra_field'] = 'Дополнительное поле';
$_['text_remove_function'] = 'Удалить функцию';
$_['info_identifier_title'] = 'Идентификатор товара';
$_['info_identifier'] = 'Поле ниже является обязательным, так как оно используется для идентификации элемента, подлежащего обновлению.';
$_['tab_quick_update'] = 'Быстрое обновление';
$_['entry_option_identifier'] = 'Идентификатор опции';
$_['entry_option_identifier_i'] = 'Оставьте пустым, чтобы обновить основной продукт';
$_['entry_option_identifier_value'] = 'Значение параметра';
$_['text_quick_update_identifier'] = 'Здесь вы можете быстро обновить свои элементы с помощью наиболее распространенных обновленных значений. <br/> Поле ниже является обязательным, поскольку оно используется для определения элемента, который нужно обновить.';
$_['text_quick_update_option_identifier'] = '<h4> Обновить опцию продукта </h4> Если вы хотите обновить только количество опций продукта, вы должны идентифицировать ваш продукт со следующими полями, выберите опцию и соответствующую ей. опция в вашем фиде импорта. <br/> Например, идентификатор опции как «Цвет» и в поле «Значение опции» выберите поле, в котором у вас есть цвет внутри. ';
$_['entry_product_id'] = 'ID продукта';
$_['entry_title'] = 'Заголовок';
$_['entry_product_name'] = 'Название продукта';
$_['entry_payment_method_name'] = 'Название способа оплаты';
$_['entry_payment_method_code'] = 'Код метода оплаты';
$_['help_field_payment_method_name'] = 'Название метода оплаты, который будет отображаться в заказе, вы можете установить только этот, если код не задан, он просто не будет предварительно выбран при редактировании заказа';
$_['help_field_payment_method_code'] = 'Здесь ожидается код в формате ocStore, например, bank_transfer, cod, paypal, free_checkout';
$_['entry_shipping_method_name'] = 'Имя метода доставки';
$_['entry_shipping_method_code'] = 'Код способа доставки';
$_['help_field_shipping_method_name'] = 'Название метода доставки, как он будет отображаться в заказе, вы можете установить только этот, если код не установлен, он просто не будет предварительно выбран при редактировании заказа';
$_['help_field_shipping_method_code'] = 'Здесь ожидается код в формате ocStore, например, free, flat, fedex, weight';
$_['entry_total_code'] = 'Общий код';
$_['help_field_code'] = 'Общий код в формате ocStore, например, total, sub_total, shipping, tax';
$_['entry_model'] = 'Модель';
$_['entry_price'] = 'Цена';
$_['entry_tax'] = 'Налог';
$_['entry_order_id'] = 'Код заказа';
$_['entry_order_id_user'] = 'Случайный идентификатор заказа';
$_['entry_create_order_total'] = 'Автоматически создавать итоговый элемент';
$_['entry_img_alt'] = 'Изображение alt';
$_['entry_separator'] = 'Разделитель';
$_['entry_subcat_separator'] = 'Разделитель подкатегорий';
$_['entry_subcat_separator_i'] = 'Например, cat1> subcat1; cat2> subcat2 ';
$_['entry_dimension_l'] = 'Длина';
$_['entry_dimension_w'] = 'Ширина';
$_['entry_dimension_h'] = 'Высота';
$_['entry_category_id'] = 'ID категории';
$_['entry_information_id'] = 'Информационный идентификатор';
$_['entry_manufacturer_id'] = 'Идентификатор производителя';
$_['entry_customer_id'] = 'Идентификатор клиента';
$_['entry_value_modifier'] = 'Mode';
$_['entry_value_modifier_i'] = 'Заменить: заменить фактическое значение новым - Добавить: добавить новое значение к фактическому - Вычесть: вычесть новое значение в фактическое';
$_['entry_email'] = 'Электронная почта';
$_['import_default_value'] = 'По умолчанию';
$_['entry_default'] = 'По умолчанию';
$_['entry_default_i'] = 'Вставьте здесь значение по умолчанию для этого поля, если поле пустое или не сопоставлено ни с одним значением, будет использоваться значение по умолчанию';
$_['help_field_category'] = 'Если в этом поле определено несколько категорий, используйте разделитель нескольких значений, например: Cat1> subcat1; Cat2> subcat2 ';
$_['help_field_related_id'] = 'Использовать несколько разделителей для вставки нескольких значений, значение может быть идентификатором продукта или идентификатором элемента, заданным на шаге 2';
$_['help_field_image'] = 'В случае нескольких значений выбирается первое';
$_['help_field_product_image'] = 'Чтобы импортировать различные изображения, вы можете использовать одно поле с несколькими разделителями или нажать «Добавить столбцы», чтобы получить изображения из различных полей';
$_['help_field_product_option_xml__'] = 'Используйте этот формат: <option> <optionType> type </optionType> <optionNameEn> Имя английского языка </optionNameEn> <optionValueEn> Значение английского языка </optionValueEn> <optionPrice> Цена </optionPrice> <optionRequired> Обязательный </optionRequired> </option> - параметры и значения параметров создаются автоматически, если их не существует. ';
$_['help_field_product_option__'] = 'Может быть отформатирован различными способами - 1: <имя>: <значение> (тип автоматически устанавливается на выбор, если опция не существует) - 2: <тип>: <имя>: < значение> 3: <тип>: <имя>: <значение>: <цена> - 4: <тип>: <имя>: <значение>: <цена>: <количество> - 5: <тип>: <имя >: <значение>: <цена>: <количество>: <вычесть> - 6: <тип>: <имя>: <значение>: <цена>: <количество>: <вычесть>: <вес> - 7: <тип>: <имя>: <значение>: <цена>: <кол-во>: <вычесть>: <вес>: <требуется> - значения параметров и параметров создаются автоматически, если их не существует. ';
$_['help_field_product_attribute__'] = 'Может быть отформатирован различными способами - 1: <имя_группы атрибутов>: <имя_атрибута>: <значение> - 2: <имя_атрибута>: <значение> 3: <значение> (заголовок используется в качестве атрибута name) - 4: <ul> <li> Имя группы: значение </li> </ul> Группа и атрибут создаются автоматически, если их не существует. В случаях 2 и 3, если атрибут не существует, он присваивается группе «По умолчанию» ';
$_['help_field_product_special'] = 'Должен быть отформатирован следующим образом: <цена> - или <customer_group_id>: <цена> - или <customer_group_id>: <приоритет>: <цена> - или <customer_group_id>: <приоритет>: <price>: <date_end> - или <customer_group_id>: <priority>: <price>: <date_start>: <date_end> (если дата не вставлена, она будет установлена ​​без ограничения по времени) ';
$_['help_field_product_discount'] = 'Должен быть отформатирован следующим образом: <цена> - или <цена>: <дата_ конец> - или <цена>: <дата_старт>: <дата_ конец> - или <количество>: <цена>: <date_start>: <date_end> - или <customer_group_id>: <qty>: <цена>: <date_start>: <date_end> - или <customer_group_id>: <qty>: <приоритет>: <цена>: <date_start>: <date_end> ';
$_['help_field_product_id'] = 'Используйте это, если хотите принудительно идентифицировать продукт';
$_['help_field_manufacturer_id'] = 'Использовать либо идентификатор производителя, либо имя производителя';
$_['help_field_product_category'] = 'Использовать либо ID категории, либо имя категории. Вы можете добавить столько подкатегорий, сколько необходимо, они будут следовать порядку, установленному здесь ';
$_['help_field_product_filter'] = 'Отформатируйте ваши фильтры следующим образом: filter_group: filter_name';
$_['help_field_stock_status_id'] = 'Работает с названием акции или ID, если имя не существует, оно будет создано';
$_['help_field_status'] = $_['help_field_notify'] = $_['help_field_newsletter'] = $_['help_field_safe'] = $_['help_field_approved'] = 'Работает со следующими значениями: 1/0 , вкл /выкл, true /false, включено /отключено, да /нет, активно /неактивно ';
$_['help_field_order_status_comment'] = 'Вы можете использовать эти теги: {tracking_no} {tracking_url}';
$_['help_field_parent_id'] = 'Если более двух уровней, это поле должно быть отформатировано с разделителем подкатегорий: Cat1> Subcat1> Subcat2';
$_['entry_salt'] = 'salt';
$_['help_field_password'] = '';
$_['help_field_salt'] = 'Соль - дополнительная защита для пароля, это поле должно быть установлено, если импортируемые пароли уже зашифрованы, если не задано, ваши пользователи не смогут войти в систему';
$_['entry_pwd_hash'] = 'Шифрование';
$_['entry_pwd_hash_i'] = 'Если ваш пароль зашифрован, проверьте соответствующее значение здесь и заполните солт-поле, которое необходимо клиенту для входа в систему';
$_['text_pwd_clear'] = 'Очистить пароль';
$_['text_pwd_hash'] = 'Зашифрованный пароль';
$_['entry_invoice_no'] = 'Счет №';
$_['entry_invoice_prefix'] = 'Префикс счета-фактуры';
$_['entry_user_agent'] = 'Пользовательский агент';

//дополнительные функции
$_['xfn_group_string'] = 'Текстовые операции';
$_['xfn_group_regex'] = 'Операции с текстом Regex';
$_['xfn_group_number'] = 'Числовые операции';
$_['xfn_group_html'] = 'HTML';
$_['xfn_group_product'] = 'Product';
$_['xfn_group_web'] = 'Web';
$_['xfn_group_other'] = 'Специальные функции';
$_['xfn_manual_value'] = 'Ручное значение - & gt;';
$_['xfn_append'] = '<i class = "fa fa-fw"> & # xf038; </i> Append';
$_['xfn_append_i'] = 'Добавить что-то после поля';
$_['xfn_prepend'] = '<i class = "fa fa-fw"> & # xf036; </i> Prepend';
$_['xfn_prepend_i'] = 'Добавить что-то перед полем';
$_['xfn_uppercase'] = '<i class = "fa fa-fw"> & # xf031; </i> Uppercase';
$_['xfn_uppercase_i'] = 'Пример: Люк, я твой отец';
$_['xfn_lowercase'] = '<i class = "fa fa-fw"> & # xf031; </i> Строчные буквы';
$_['xfn_lowercase_i'] = 'Пример: Люк, я твой отец';
$_['xfn_ucfirst'] = '<i class = "fa fa-fw"> & # xf031; </i> Прописные буквы на первой букве';
$_['xfn_ucfirst_i'] = 'Пример: Люк, я твой отец';
$_['xfn_ucwords'] = '<i class = "fa fa-fw"> & # xf031; </i> Прописные буквы в первых буквах слов';
$_['xfn_ucwords_i'] = 'Пример: Люк, я твой отец';
$_['xfn_substr'] = '<i class = "fa fa-fw"> & # xf0c4; </i> Усеченная строка';
$_['xfn_substr_i'] = 'Получить x первых символов поля';
$_['xfn_urlify'] = '<i class = "fa fa-fw"> & # xf0c1; </i> Формат для URL';
$_['xfn_urlify_i'] = 'Форматировать строку для использования в ключевом слове seo, применять строчные буквы и заменять пробелы на тире, если применяется транслит, все акцентированные символы будут преобразованы в их эквивалент ascii';
$_['xfn_substr_set'] = 'Сократить число символов';
$_['xfn_substr_of'] = 'От';
$_['xfn_nl2br'] = '<i class = "fa fa-fw"> & # xf121; </i> Преобразовать разрывы строк в HTML';
$_['xfn_nl2br_i'] = 'Разрывы строк будут преобразованы в формат html с тегом br';
$_['xfn_strip_tags'] = '<i class = "fa fa-fw"> & # xf121; </i> вырезать теги HTML';
$_['xfn_strip_tags_i'] = 'Удалить любой тег HTML, чтобы получить чистый текст';
$_['xfn_html_encode'] = '<i class = "fa fa-fw"> & # xf121; </i> Кодировать сущности HTML';
$_['xfn_html_encode_i'] = 'Преобразование специальных символов в объекты HTML';
$_['xfn_html_decode'] = '<i class = "fa fa-fw"> & # xf121; </i> Декодировать объекты HTML';
$_['xfn_html_decode_i'] = 'Преобразовать все сущности HTML в соответствующие им символы - может быть полезно, если у вас html-контент неправильно импортирован';
$_['xfn_date_convert'] = '<i class = "fa fa-fw"> & # xf073; </i> Конвертер даты';
$_['xfn_date_convert_i'] = 'Преобразовать дату в формат SQL, выберите текущий формат поля даты для правильной конвертации';
$_['xfn_if_table'] = '<i class = "fa fa-fw"> & # xf059; </i> Условное значение';
$_['xfn_if_table_i'] = 'Установите окончательное значение в зависимости от вашего фактического значения, используйте оператор для сравнения со значением поля и выберите окончательное значение. Пример: ~ (колесики): Car означает, что если в текущем поле есть слово «колеса», то в качестве выходного сигнала укажите «Car». ';
$_['xfn_replace'] = '<i class = "fa fa-fw"> & # xf0d0; </i> Заменить текст';
$_['xfn_replace_set'] = 'Заменить';
$_['xfn_regex_replace'] = '<i class = "fa fa-fw"> & # xf0d0; </i> Regex replace';
$_['xfn_regex_replace_i'] = 'Заменить часть строки с помощью regex, например, если вы хотите изменить поле, например, бренд: Sony | тип: на ноутбуке вместо MyBrand указывать MyBrand, после поиска по regex: brand: (+.) | заменить: бренд: MyBrand | ';
$_['xfn_regex'] = '<i class = "fa fa-fw"> & # xf0c4; </i> Regex extract';
$_['xfn_regex_i'] = 'Извлеките часть строки, используя regex, используйте (), чтобы определить часть, которую вы хотите извлечь, например, если у вас есть поле наподобие brand: Sony | type: Laptop, и вы хотите для извлечения Sony для вставки в бренды примените следующее регулярное выражение: brand: (. +) | ';
$_['xfn_regex_remove'] = '<i class = "fa fa-fw"> & # xf12d; </i> Regex remove';
$_['xfn_regex_remove_i'] = 'Удалить текст с помощью регулярного выражения, например, удалить любой специальный символ из строки: [^ 0-9a-zA-Z]';
$_['xfn_remove'] = '<i class = "fa fa-fw"> & # xf12d; </i> Удалить текст';
$_['xfn_remove_set'] = 'Удалить';
$_['xfn_remote_content_set'] = 'Получить контент с URL поля';
$_['xfn_remote_content'] = '<i class = "fa fa-fw"> & # xf019; </i> Удаленный контент';
$_['xfn_remote_content_i'] = 'Получить содержимое страницы, содержащейся в URL, может быть полезно, если в канале указана только ссылка для получения описания или других данных.';
$_['xfn_add'] = '<i class = "fa fa-fw"> & # xf1ec; </i> Add';
$_['xfn_subtract'] = '<i class = "fa fa-fw"> & # xf1ec; </i> Subtract';
$_['xfn_multiply'] = '<i class = "fa fa-fw"> & # xf1ec; </i> Multiply';
$_['xfn_divide'] = '<i class = "fa fa-fw"> & # xf1ec; </i> Divide';
$_['xfn_round'] = '<i class = "fa fa-fw"> & # xf1ec; </i> Round';
$_['placeholder_xfn_if_table'] = '~ (search_value): final_value (по одному в строке)';
$_['placeholder_xfn_wholesale'] = 'max_price: множитель (по одному на строку)';
$_['xfn_wholesale'] = '<i class = "fa fa-fw"> & # xf1ec; </i> Множитель оптовой цены';
$_['xfn_wholesale_i'] = 'Умножьте текущую цену на другой коэффициент в зависимости от значения, например, если вы хотите, чтобы вся цена ниже 10 была умножена на 2, просто напишите 10: 2, а затем, если вы хотите, чтобы вся цена ниже 50 до умножьте на 1,5, добавьте новую строку и напишите 50: 1,5 ';
$_['xfn_skip_set'] = 'Пропустить текущий элемент, если';
$_['xfn_skip_db_set'] = 'Пропустить текущий элемент, если';
$_['xfn_option'] = '<i class = "fa fa-fw"> & # xf0c9; </i> Опция продукта';
$_['xfn_option_set'] = 'Текущая строка является опцией продукта if';
$_['xfn_skip'] = '<i class = "fa fa-fw"> & # xf054; </i> Пропустить при импорте значения';
$_['xfn_skip_i'] = 'Пропустить текущий элемент импорта, если значение в вашем файле импорта совпадает с другим значением (значением файла импорта или значением вручную)';
$_['xfn_skip_db_i'] = 'Пропустить текущий элемент импорта, если значение элемента вашего магазина соответствует другому значению (значение файла импорта или значение вручную)';
$_['xfn_skip_db'] = '<i class = "fa fa-fw"> & # xf054; </i> Пропустить существующее значение';
$_['xfn_delete_item'] = '<i class = "fa fa-fw"> & # xf014; </i> Удалить или отключить элемент';
$_['xfn_multiple_separator'] = '<i class = "fa fa-fw"> & # xf03a; </i> Разделитель нескольких значений';
$_['xfn_multiple_separator_set'] = 'Установить разделитель нескольких значений как';
$_['xfn_for_column'] = 'Для столбца';
$_['xfn_source_field'] = 'Исходное поле';
$_['xfn_target_field'] = 'Целевое поле';
$_['text_if_table_table'] = '<div style = "cursor: text"> Условная таблица <br/> <span style = "color: # 888"> <b> Равен </b> <br/> = (тест): final_value <br/> = (тест): final_value <br/> <б> Содержит </b> <br/> ~ (тест): final_value <br/> ~ (тест): final_value < br /> <b> Больше </b> <br/> & gt; (тест): final_value <br/> & lt; (тест): final_value <br/> </span> </div> ';
$_['text_wholesale_table'] = 'Таблица множителей';
$_['text_round'] = 'Round';
$_['xfn_if'] = 'If';
$_['xfn_of'] = 'Of';
$_['xfn_to'] = 'To';
$_['xfn_by'] = 'By';
$_['xfn_in'] = 'In';
$_['xfn_for'] = 'For';
$_['xfn_from'] = 'От';
$_['xfn_after'] = 'После';
$_['xfn_before'] = 'До';
$_['xfn_is_equal'] = 'равно';
$_['xfn_is_not_equal'] = 'не равно';
$_['xfn_contain'] = 'содержит';
$_['xfn_not_contain'] = 'не содержать';
$_['xfn_is_greater'] = 'больше чем';
$_['xfn_is_lower'] = 'ниже чем';
$_['xfn_mode'] = 'Mode';
$_['xfn_precision'] = 'С точностью до';
$_['xfn_precision_'] = 'Без раунда';
$_['xfn_precision_0'] = 'Integer (1)';
$_['xfn_precision_1'] = '1 десятичное число (1.2)';
$_['xfn_precision_2'] = '2 десятичных знака (1.23)';
$_['xfn_precision_3'] = '3 десятичных знака (1.234)';
$_['xfn_precision_4'] = '4 десятичных знака (1.2345)';
$_['text_delete_if'] = 'Удалить, если';
$_['text_value_is'] = 'Равен';
$_['text_urlify_basic'] = 'Basic';
$_['text_urlify_default'] = 'Базовое форматирование';
$_['text_urlify_ascii'] = 'Транслит в ascii';
$_['text_translit'] = 'Транслит';
$_['info_extra_functions'] = 'С помощью дополнительных функций вы можете выполнять определенные операции с исходными данными, такие как, например, умножение числа, ввод строки в верхнем регистре и т. д. <br/> <br/> Использование: < ol> <li> Выберите нужную функцию в поле ниже </li> <li> Нажмите «Добавить функцию» </li> <li> Выберите поле источника, к которому нужно применить функцию </li> <li > Определите другие параметры, если таковые имеются </li> <li> Выберите целевое поле, в котором вы хотите сохранить результат. </Li> </ol> Вы можете применить несколько операций к одному полю, они будут применены в порядке они определены. <br/> <br/> Если вы хотите сохранить некоторые данные в дополнительных полях, не забудьте добавить дополнительные поля в шаге 2. ';
$_['text_date_format_eu'] = 'EU: ДД /ММ /ГГГГ';
$_['text_date_format_us'] = 'США: ММ /ДД /ГГГГ';
$_['text_convert_from'] = 'Преобразовать из';

//привязки опций
$_['text_optbinding_name'] = 'Тип';
$_['text_optbinding_bind_to'] = 'Поле';
$_['text_get_optbinding'] = 'Получить дополнительные поля параметров';

//привязки категории
$_['tab_cat_binding'] = 'Привязки категорий';
$_['entry_cat_binding_mode'] = 'Режим привязки';
$_['text_cat_binding_default'] = 'Смешанный - вставьте связанные категории, а не связанные категории со значением поля';
$_['text_cat_binding_exclusive'] = 'Эксклюзив - вставлять только связанные категории, значение поля категории игнорируется';
$_['text_cat_binding_exclusive_skip'] = 'Исключительно, пропустить пусто - вставлять только связанные категории, значение поля категории игнорируется, пропустить элемент, если нет категории';
$_['text_cat_binding_skip'] = 'Пропускать несвязанные - вставлять только связанные категории, элементы с хотя бы одной несвязанной категорией будут пропущены';
$_['text_catbinding_name'] = 'Исходная категория';
$_['text_catbinding_bind_to'] = 'Привязать к';
$_['text_get_bindings'] = 'Обновить список категорий';
$_['text_no_bindings'] = 'Связывание категорий не определено, нажмите кнопку обновления, чтобы увидеть все категории в вашем текущем файле импорта.';
$_['text_no_binding'] = '- none -';
$_['info_cat_binding_title'] = 'Привязки категорий';
$_['info_cat_binding'] = 'Если в исходных данных у вас есть имена категорий, которые не соответствуют вашим, вы можете использовать эту функцию для определения привязки для каждой категории в исходном файле. <br/> <br/> Использование : <ul> <li> Если это еще не сделано, выберите поле своей категории на вкладке "Ссылки" </li> <li> Нажмите "Обновить список категорий", чтобы получить список всех категорий, существующих в вашем исходном файле </li> <li> Выберите, в какую категорию ocStore вы хотите перенести каждую категорию источников. </li> </ul> Не обязательно устанавливать все категории, просто удалите те, которые не требуют привязки, для них будет применяться поведение по умолчанию. (проверьте, существует ли категория, и попробуйте создать ее, если нет). <br/> Если вы хотите, чтобы ваши категории вставлялись только на основе связанных значений, выберите режим привязки exclisve. ';
$_['info_col_binding_skip'] = 'Элемент пропущен, так как для какой-либо категории не было найдено привязки категории';
$_['info_col_binding_skip_empty'] = 'Элемент пропущен, поскольку ни одна категория не была привязана к этому продукту';

//Шаг 4
$_['text_simu_summary'] = 'Сводка моделирования (10 строк):';
$_['text_full_simu_summary'] = 'Полный отчет по симуляции:';
$_['text_item_to_update'] = 'Элемент для обновления';
$_['entry_row_status'] = 'Действие строки';
$_['text_simu_inserted'] = 'Вставить';
$_['text_simu_updated'] = 'Обновить';
$_['text_simu_disabled'] = 'Отключить';
$_['text_simu_qtyzero'] = 'Установить количество в ноль';
$_['text_simu_deleted'] = 'Удалить';
$_['text_simu_skipped'] = 'Пропустить';
$_['text_simu_error'] = 'Ошибка';

//Шаг 5
$_['text_import_label'] = 'Импортировать метку';
$_['text_import_label_i'] = 'Дайте имя этому сеансу импорта, затем в списке товаров вы сможете отфильтровать товары, которые были импортированы на этот раз. Оставьте пустым, чтобы не изменять метку импорта, если она существует. ';
$_['text_process_summary'] = 'Сводка процесса';
$_['text_rows_csv'] = 'Всего строк в файле';
$_['text_rows_process'] = 'Всего строк для обработки';
$_['text_rows_insert'] = 'Всего строк для вставки';
$_['text_rows_update'] = 'Всего строк для обновления';
$_['text_process_done'] = 'Статус процесса';
$_['text_rows_processed'] = 'Обработано';
$_['text_rows_inserted'] = 'Вставлено';
$_['text_rows_updated'] = 'Обновлено';
$_['text_rows_disabled'] = 'Отключено';
$_['text_rows_qtyzero'] = 'Установить qty на ноль';
$_['text_rows_deleted'] = 'Удалено';
$_['text_rows_skipped'] = 'Пропущено';
$_['text_rows_error'] = 'Ошибка';
$_['text_empty_line_skip'] = 'Пустая строка';

$_['entry_color_scheme'] = 'Цветовая схема: <span class = "help"> Быстрый доступ к некоторым цветовым схемам, отредактируйте их на вкладке дизайна </span>';
$_['entry_logo'] = 'Logo:';
$_['entry_feed_title'] = 'Имя:';
$_['entry_cache_delay'] = 'Задержка кэша: <span class = "help"> Сколько времени отображать сгенерированный файл до повторной генерации? </span>';
$_['entry_language'] = 'Язык: <span class = "help"> </span>';
$_['entry_feed_url'] = 'URL фида данных: <span class = "help"> Передать этот URL-адрес службе назначения </span>';
$_['entry_additional_image'] = 'Дополнительные изображения';

$_['text_no_change'] = '- Без изменений -';
$_['text_on'] = 'On';
$_['text_off'] = 'Off';

//Формат файла
$_['text_format_csv'] = 'CSV';
$_['text_format_xml'] = 'XML';
$_['text_format_xls'] = 'XLS';
$_['text_format_xlsx'] = 'XLSX';
$_['text_format_ods'] = 'ODS';
$_['text_format_pdf'] = 'PDF';
$_['text_format_html'] = 'HTML';

//Экспорт
$_['text_tab_1'] = 'Экспорт';
$_['entry_export_type'] = 'Тип экспорта';
$_['entry_export_type_i'] = 'Какие данные вы хотите экспортировать?';
$_['entry_export_format'] = 'Формат экспорта';
$_['entry_export_format_i'] = 'Выберите формат выходного файла';
$_['text_start_export'] = 'Создать файл экспорта';
$_['export_all'] = '- All -';
$_['export_all_filters'] = 'Все фильтры';
$_['export_product_filters'] = 'Фильтры товаров';
$_['export_all_attributes'] = 'Все атрибуты';
$_['export_product_attributes'] = 'Атрибуты продукта';
$_['mode'] = 'Mode';

//Экспорт фильтров
$_['export_filters'] = 'Фильтры';
$_['total_export_items'] = 'Всего элементов для экспорта:';
$_['filter_language'] = 'Язык';
$_['filter_manufacturer'] = 'Производитель';
$_['filter_manufacturer_i'] = 'Вы можете выбрать нескольких производителей, начать печатать текст, чтобы быстро найти своего производителя';
$_['filter_category'] = 'Категория';
$_['filter_category_i'] = 'Вы можете выбрать несколько категорий, начать набирать текст, чтобы быстро найти свою категорию';
$_['filter_store'] = 'Store';
$_['filter_limit'] = 'Limit';
$_['filter_limit_i'] = 'Ограничить количество элементов для экспорта. Начало: начать экспорт из этого элемента - Ограничение: сколько элементов для экспорта';
$_['filter_order_id'] = 'Код заказа';
$_['filter_order_status'] = 'Статус заказа';
$_['filter_order_status_i'] = 'Если ничего не выбрано, будут экспортированы все статусы заказов, кроме отсутствующих заказов';
$_['filter_customer'] = 'Клиент';
$_['filter_date_added'] = 'Дата добавления';
$_['filter_date_modified'] = 'Дата изменения';
$_['filter_total'] = 'Всего';
$_['filter_limit_start'] = 'Старт';
$_['filter_limit_limit'] = 'Limit';
$_['filter_start'] = 'Старт';
$_['filter_end'] = 'Конец';
$_['filter_min'] = 'Min';
$_['filter_max'] = 'Макс';
$_['text_missing_orders'] = 'Отсутствующие заказы';

//Параметры экспорта
$_['export_options'] = 'Опции';
$_['export_fields'] = 'Экспорт полей';
$_['export_fields_i'] = 'Выберите, какие поля вы хотите иметь в вашем файле экспорта';
$_['param_price_multiplier'] = 'Множитель цены';
$_['param_price_multiplier_i'] = 'Изменить цену, отображаемую в файле экспорта, например, установить 1.12, чтобы добавить 12% к исходной цене';
$_['param_image_path'] = 'Режим пути к изображению';
$_['param_image_path_i'] = 'Используйте полный URL-адрес, чтобы получить полный URL-адрес вашего изображения - относительный путь ocStore следует использовать только в том случае, если вы будете использовать этот экспорт на том же веб-сайте';
$_['image_path_relative'] = 'Относительный путь ocStore';
$_['image_path_absolute'] = 'Полный URL';

//Конфигурация
$_['text_tab_2'] = 'Опции';
$_['tab_option_1'] = 'Производительность';
$_['tab_option_2'] = 'Задания Cron';
$_['tab_option_3'] = 'Основные параметры';
$_['entry_default_import_label'] = 'Метка импорта по умолчанию';
$_['default_label_i'] = 'Установите здесь метку по умолчанию для вашего сеанса импорта, это поможет вам легко фильтровать товары, импортированные в определенный сеанс, в списке товаров. <br/> <br/> Вы можете использовать эти теги: <code> [профиль] [день] [месяц] [год] </code> ';
$_['entry_batch_import'] = 'Импортировать номер партии';
$_['entry_batch_export'] = 'Экспортировать номер партии';
$_['entry_sleep'] = 'Задержка процесса';
$_['batch_import_i'] = '<h4> Номер партии </h4> <p> Выберите количество элементов, обрабатываемых по каждому запросу, измените этот параметр, чтобы повысить производительность импорта /экспорта. <br/> Большое число может ускорить время обработки, но слишком большое число может привести к сбою в зависимости от ресурсов вашего сервера. </p> <h4 style = "margin-top: 20px"> Задержка процесса </h4> <p> При импорте и экспорте используется очень большое количество Ресурсы с сервера, на общем хосте или низкопрофильном сервере он может использовать почти все ресурсы, и тогда ваш сайт может быть недоступен во время процесса. <br/> Параметр задержки позволяет подождать несколько раз перед обработкой каждого элемента, на этот раз освободит некоторые ресурсы, чтобы сервер мог некоторое время дышать и обрабатывать другие запросы. <br/> Число указывается в миллисекундах, что означает 1000 мс = 1 секунду, рекомендуемое значение - от 50 до 500. <br/> Имейте в виду, что большое значение этого параметра значительно увеличит время процесса импорта. </p> ';

//Cron
$_['text_tab_cron_config'] = 'Конфигурация';
$_['text_tab_cron_import'] = 'Импорт';
$_['text_tab_cron_export'] = 'Экспорт';
$_['text_tab_cron_report'] = 'Отчет';
$_['text_cli_log_save'] = 'Сохранить файл журнала';
$_['text_cli_clear_logs'] = 'Очистить журналы';
$_['entry_cron_key'] = 'Безопасный ключ';
$_['entry_cron_key_i'] = 'Определите свой собственный безопасный ключ, он должен быть включен в команду cron';
$_['entry_cron_command'] = 'Команда Cron';
$_['text_cron_label'] = 'Установить метку импорта (будет использоваться метка профиля или метка по умолчанию, если она не определена):';
$_['text_cron_export_email'] = 'Отправить файл экспорта на электронную почту (это будет работать только для файлов не слишком большого размера):';
$_['entry_cron_params'] = 'Дополнительные параметры';
$_['entry_cron_command_i'] = 'Это команда, которую вам нужно будет вводить в ваших заданиях cron (adapt [path_to_php] действительно делает его совместимым с исполняемым файлом вашего сервера, может быть /usr /bin /php, /usr /local /bin /php, /usr /local /cpanel /3rdparty /bin /php, ...) ';
$_['entry_cron_params_i'] = 'Эти параметры являются необязательными, вы можете добавить параметр после основной команды, добавить пробел между каждым параметром';
$_['cron_jobs_i'] = 'Вы можете автоматически запускать предопределенные профили с помощью заданий cron. <br/> <br/> Все, что вам нужно сделать, - это определить профиль, изменив все настройки на первой вкладке, а затем сохранить это в шаге 4. В конце команды укажите точное имя вашего профиля. <br/> Будет создан отчет, чтобы вы могли проконсультироваться здесь, если все прошло хорошо. <br/> <br/> Обратите внимание на cron задания работают только с файлами по URL, FTP или локальному пути, а не с загруженными файлами, предназначенными для немедленного использования. <br/> <br/> <b> Настройте свои задания cron: </b> <ol> <li > Перейдите на вкладку импорта и выберите файл для работы с ним. Вы должны использовать файл в URL, FTP или по локальному пути </li> <li> Настройте свой фид с нужными параметрами, перейдите к шагу 4 </li> <li> На шаге 4 сохраните свой профиль </li> <li> Зайдите в свою cPanel или администрацию сервера, чтобы настроить задание cron </li> <li> Скопируйте нужную команду ниже (не забудьте изменить имя вашего профиля) </li> <li> Это сделано, ваш cron будет работать на основе ваших параметров, и вы можете проверить, все ли идет хорошо во вкладке отчета. </li> </ol> ';

$_['text_tab_about'] = 'About';

//Предупреждения
$_['warning'] = 'Warning';
$_['warning_category_id'] = 'ID категории не найден.';
$_['warning_discount_format'] = 'Неверный формат скидки, формат должен быть следующим: <b> & lt; customer_group_id & gt;: & lt; количество & gt;: & lt; priority & gt;: & lt; цена & gt;: & lt; date_start & gt;: & lt; date_end & gt; /b> эта скидка не будет добавлена ​​к товару ';
$_['warning_remote_image_not_found'] = 'Удаленное изображение не найдено:';
$_['warning_store_not_found'] = 'Магазин не найден:% s, убедитесь, что имя магазина существует';

//Вступление
$_['entry_status'] = 'Статус:';

//Сообщение
$_['text_skip_insert'] = 'Действие нового элемента настроено на пропуск новых элементов';
$_['text_skip_update'] = 'Существующее действие элемента настроено на пропуск существующих элементов';
$_['text_skip_quick_update'] = 'Идентификатор не найден в вашей базе данных';
$_['text_skip_delete'] = 'Элемент для удаления не существует';
$_['text_insert_option'] = 'Добавить опцию';
$_['text_skip_option_not_found'] = 'Пропущено, поскольку опция не найдена';
$_['text_skip_product_not_found'] = 'Пропущено, потому что соответствующий продукт не найден';
$_['text_skip_option_no_product'] = 'Строка опции пропущена, поскольку соответствующий продукт не найден';
$_['text_skip_option_no_option'] = 'Строка опции пропущена, потому что опция не найдена';

//Информация
$_['info_title_default'] = 'Помощь';
$_['info_msg_default'] = 'Раздел справки по этой теме не найден';
$_['info_soft_update_mode'] = 'Обновить режим сохранения: будут обновлены только отображаемые поля.';
$_['current_server_path'] = 'Это путь к корневому каталогу вашей ocStore:';
$_['text_filter_group'] = 'Группа фильтров';
$_['text_filter_name'] = 'Имя фильтра';
$_['info_filter_title'] = 'Расширенный фильтр импорта';
$_['info_filter_xml'] = '
<p> Например, у вас есть такой массив: <br/>
<code style="white-space:pre">'.print_r(array('0'=> array('groupEn' => 'Filter group', 'nameEn' => 'Filter name')), true).'</code></p>
<p> В этом случае определите основной фильтр, чтобы он соответствовал полю, содержащему массив значений, и в определенных ниже параметрах установите группу фильтра в <b>groupEn</b> и имя фильтра в <b>nameEn</b>. </р>';
$_['text_attribute_group'] = 'Группа атрибутов';
$_['text_attribute_name'] = 'Имя атрибута';
$_['text_attribute_value'] = 'Значение атрибута';
$_['info_attributes_title'] = 'Импорт атрибутов';
$_['info_attributes_xml_title'] = 'Расширенные параметры для массива значений (импорт XML)';
$_['info_attributes'] = '
<p> Может быть отформатирован различными способами:
<ul> <LI> attribute_group_name: имя_атрибут: значение </LI>
<Li> attribute_name: значение </li>
<li> значение (заголовок используется в качестве имени атрибута) </li>
<li> & lt; ul & gt; li & gt; Имя группы: значение & lt; /li & gt; & lt; /ul & gt; </li> </ul> </p>
<p> Группа и атрибут создаются автоматически, если их не существует. Если атрибут не существует и группа не определена, он автоматически назначается группе «По умолчанию». </P> ';
$_['info_attributes_xml'] = '
<h4> Дело 1 </h4>
<p> Например, у вас есть такой массив: <br/>
<code style="white-space:pre">'.print_r(array('0'=> array('name' => 'Attribute name', 'value' => array('val' => 'Attribute value'))), true).'</code></p>
<p> В этом случае определите основной атрибут, чтобы он соответствовал полю, содержащему массив значений, и в определенных ниже параметрах задайте для имени атрибута значение <b> name </b>, а для значения атрибута - <b> значение /val </b>. . </р>
<h4> Дело 2 </h4>
<p> XML отформатирован как: <br/>
<code style = "white-space: pre"> & lt; attribute attribute_name_1 = "attribute_value_1" attribute_name_2 = "attribute_value_2" & gt; & lt; /attribute & gt; </code> </p>
<p> Установите для атрибута <b> атрибуты </b> и вставьте ключевое слово [attribute] в <b> имя атрибута </b></p>';
$_['info_options_title'] = 'Импорт опций';
$_['info_options_advanced_title'] = 'Расширенные параметры для импорта параметров';
$_['info_options_xml_title'] = 'Расширенные параметры для массива значений (импорт XML)';
$_['info_options'] = '
<p> Может быть отформатирован различными способами:
<UL>
<li> значение (имя - это имя заголовка или узла, тип автоматически устанавливается на выбор, если опция не существует) </li>
<li> name: value (тип автоматически устанавливается на выбор, если опция не существует) </li>
<li> тип: имя: значение </li>
<li> тип: имя: значение: цена </li>
<li> тип: имя: значение: цена: кол-во </li>
<li> тип: имя: значение: цена: кол-во: вычесть </li>
<li> тип: имя: значение: цена: кол-во: вычесть: вес </li>
<li> тип: имя: значение: цена: кол-во: вычесть: вес: требуется </li> </ul> </p>
<p> Параметры и значения параметров создаются автоматически, если их не существует. </p> ';
$_['info_options_advanced'] = '
<p> <b> Отдельные поля для параметров </b> <br/> Если ваши параметры расположены в отдельных полях, оставьте поле основного параметра пустым и нажмите «Получить расширенные поля параметров», чтобы иметь возможность устанавливать их отдельно. < /р>
<p> <b> В вашем файле импорта параметры указаны как новая строка. </b> <br/> Затем настройте поля расширенных параметров, как описано здесь, и перейдите на вкладку «Дополнительные функции», чтобы добавить функцию «Параметр продукта». "указать, как идентифицировать строку параметров. ';
$_['info_options_xml'] = '

<p> Например, у вас есть такой массив: <br/>
<code style="white-space:pre">'.print_r(array('0'=> array('name' => 'Option name', 'value' => array('val' => 'Option value'))), true).'</code></p>
<p> В таком случае определите основной параметр, чтобы он соответствовал полю, содержащему массив значений, и в определенных ниже параметрах задайте для имени параметра значение <b> name </b>, а для значения параметра - <b> значение /val </b>. . <br/>
Если у вас есть несколько полей значений, и значения могут быть в одном или другом поле, то вы можете определить для проверки в обоих полях, используя | разделить их следующим образом: field1 | field2 </p> ';

//Ошибка
$_['warning_incorrect_image_format'] = 'Неправильный формат изображения:';
$_['error_curl'] = 'Произошла ошибка при попытке загрузить файл, возможно, из-за того, что файл не существует или запрещен доступ к серверу. <br/> Подробности: <b>% s </b>';
$_['error_extension'] = 'Тип файла не найден или не совместим для импорта: <b>% s </b>, допустимые типы импорта: csv, xml, xls, xlsx, odt. Попробуйте форсировать расширение файла. ';
$_['error_file_not_found'] = 'Предупреждение: файл не может быть открыт, проверьте правильность пути';
$_['error_xml_no_data'] = 'Предупреждение: данные с данным xml-узлом не найдены, убедитесь, что вы правильно указали имя узла, содержащего ваш набор данных';
$_['error_permission'] = 'Предупреждение: у вас нет прав на изменение этого модуля!';
$_['error_permission_demo'] = 'Демонстрационный режим, сохранение не разрешено';